[
  {
    "session_type": "Presentation",
    "title": "Welcome with Burke",
    "description": "NOT_FOUND",
    "track": "TRACK 5: LEADERSHIP, STRATEGY & ROI",
    "time": "Tuesday, 8 October 2024 11:00am - 11:10am",
    "speakers": [
      {
        "name": "Tara Wiley",
        "title": "Vice President, Qualitative",
        "company": "Burke",
        "profileUrl": "https://informaconnect.com/tmre/speakers/tara-wiley/",
        "bio": "Tara serves as Vice President at Burke, where she oversees the company’s Qualitative business efforts. With nearly 20 years of research experience, she excels at helping clients tackle complex business challenges. Tara is passionate about connecting with people in innovative ways to uncover their inspirations. Her curiosity and expertise drive her leadership, shaping the overall strategy for Burke’s Qualitative business and team."
      }
    ]
  },
  {
    "session_type": "Presentation",
    "title": "Strategic Research Workshops: Fueling Stakeholder Alignment and Action",
    "description": "In today’s fast-paced world, many internal stakeholders can get caught up in the daily demands of their jobs and forget to take a step back and really think about how to turn their research findings into actionable strategies. Hormel and C+R Research teamed up for an interactive workshop that brought together a cross-functional team to collaborate and share ideas that maintained a shopper-centric focus, streamlined planning efforts, and provided inspiration for future creatives and communications.\n\nIn our session, we’ll reveal ways to improve research utilization to make your job easier and more effective. Join us to learn key tips and takeaways for:\n\nCultivating a Safe, Focused, and Fun Environment: Learn how to foster an atmosphere of trust, encouraging collaboration and innovative thinking.\nBuilding Ideas Together: Uncover how leveraging research and collaborative brainstorming can generate stronger solutions to move your business forward.\nCrafting a Clear and Concise Playbook: Develop a clear and concise playbook summarizing workshop results, providing a go-to resource for internal teams and agency partners for future inspiration and planning efforts.\n\n",
    "track": "TRACK 5: LEADERSHIP, STRATEGY & ROI",
    "time": "Tuesday, 8 October 2024 11:10am - 11:40am",
    "speakers": [
      {
        "name": "Kathleen Blum",
        "title": "Vice President, Shopper Insights",
        "company": "C+R Research",
        "profileUrl": "https://informaconnect.com/tmre/speakers/kathleen-blum/",
        "bio": "Kathleen Blum has over 30 years of marketing, strategy, consumer and shopper insights experience on both the client and supplier sides. At C+R Research, Kathleen leads the ShopperEyes® practice which leverages a suite of customizable approaches to create innovative solutions for manufacturers and retailers facing the ever-changing retail landscape and shopper expectations, including an omni-channel shopper journey model and a new Shopper Segmentation Study that aid brands in understanding their shoppers’ behaviors.\nPrior to joining C+R, Kathleen worked for Champion Petfoods, Mars, MillerCoors, W.W. Grainger, Willard Bishop Consulting and Jim Beam Brands International. She is also a recipient of the Path to Purchase Institute’s Who’s Who in Shopper Insights."
      },
      {
        "name": "Jenny Rechner",
        "title": "Shopper Insights Manager",
        "company": "Hormel Foods",
        "profileUrl": "https://informaconnect.com/tmre/speakers/jenny-rechner/",
        "bio": "Jenny Rechner is a Shopper Insights Manager at Hormel Foods where she leads market research studies across the enterprise in order to achieve strategic initiatives. Jenny possesses a keen ability to synthesize complex insights into customer-facing presentations, which are instrumental in unlocking mutual growth between Hormel and their retail partners. Her efforts have consistently led to strategy execution, category growth, and the establishment of long-term retailer partnerships. Prior to her current role, Jenny held roles in sales, marketing, and analytics – where all three experiences helped her find her true passion for storytelling through data & insights."
      }
    ]
  },
  {
    "session_type": "Presentation",
    "title": "Fireside Chat: Driving Impact in a Disrupted World",
    "description": "In a world where Consumer Insights teams are facing challenges due to technology and the macroeconomy, we need to think smarter about how to drive impact vs. activity to remain a trusted, relevant partner to our stakeholders. This session will dive into how Insights professionals must be laser focused on driving outcomes over activity, ruthlessly prioritize and align our work to the most important business objectives; and leverage AI to enable customer-centricity at scale.",
    "track": "TRACK 5: LEADERSHIP, STRATEGY & ROI",
    "time": "Tuesday, 8 October 2024 11:45am - 12:15pm",
    "speakers": [
      {
        "name": "Thomas Walker",
        "title": "VP Global Consumer Insights",
        "company": "eBay",
        "profileUrl": "https://informaconnect.com/tmre/speakers/thomas-walker/",
        "bio": "Thomas Walker is VP of Global Consumer Insights at eBay. He is responsible for ensuring the company’s strategic decisions are guided by a rich and holistic base of market and consumer insight. Thomas and his team are working to modernize eBay’s foundational research and insights platform spanning early market opportunity identification, consumer segmentation and targeting, brand strategy and positioning, and shopper experience. Thomas joined eBay in 2017. Prior to eBay, Thomas spent five years in various leadership roles at Kantar Group. He also spent 14 years serving as a trusted advisor to C-level execs to drive growth of billion dollar business sectors for IBM, Microsoft and Coca-Cola."
      },
      {
        "name": "Jim Whaley",
        "title": "CEO",
        "company": "OvationMR",
        "profileUrl": "https://informaconnect.com/tmre/speakers/jim-whaley/",
        "bio": "Jim Whaley is CEO of OvationMR, a global market insights agency he founded in 2016 that focuses on diverse B2B audiences, particularly in the supply chain to address business operations and market challenges related to sustainability, fair trade sourcing, enterprise resource planning. All factors which weigh on customers making brand choices in the experience economy.\n\nJim is an established member of the market research community and serves on the board of Directors for the Market Research Institute International (mrii.org) and the Market Research Educational Foundation (mref.org).\n\nWhen Jim is not doing market research he gets involved in producing independent films, which have been fortunate to receive acclaim at Cannes Film Festival and London International Motion Picture Awards among others."
      }
    ]
  },
  {
    "session_type": "Presentation",
    "title": "Fireside Chat: Domino's & Zappi: Building a Connected, Iterative Advertising System to Create Winning Campaigns Every Time",
    "description": "In this talk, Karen Sharp, SVP, Global Enterprise Customers at Zappi, along with Becky Blowers, Director, Research Science, Global Analytics and Insights at Domino's, and Sarah Goslin, Associate Manager, Research Science, Global Analytics at Domino's, will discuss the creation of Domino’s “You Tip We Tip” marketing campaign, from inspiration through execution.\n\nThe speakers will explore how Domino’s identified and addressed consumer’s tipping fatigue, and developed a marketing campaign to inspire repeat customers. By partnering with Zappi, Domino's leveraged an iterative advertising development process to produce highly effective creative and create a win-win for consumers and employees alike.\n\nKey Learnings:\n\nTransforming consumer pain points into powerful marketing opportunities to drive brand loyalty and engagement.\nHow to utilize a connected data asset to inspire and create innovative and effective creative campaigns.\nThe value of iterative advertising development to ensure campaigns maximize impact and effectiveness with consumers.",
    "track": "TRACK 5: LEADERSHIP, STRATEGY & ROI",
    "time": "Tuesday, 8 October 2024 12:20pm - 12:50pm",
    "speakers": [
      {
        "name": "Karen Sharp",
        "title": "SVP, Global Enterprise Customers",
        "company": "Zappi",
        "profileUrl": "https://informaconnect.com/tmre/speakers/karen-sharp/",
        "bio": "Karen Sharp is SVP, Global Enterprise Customers at Zappi, where she brings more than 25 years of strategy, advertising and innovation experience partnering with global customers to help transform insights to drive impact and growth."
      },
      {
        "name": "Becky Blowers",
        "title": "Director of Research Science",
        "company": "Domino's Pizza",
        "profileUrl": "https://informaconnect.com/tmre/speakers/becky-blowers/",
        "bio": "Becky Blowers, Director of Research Science, joined Domino’s Global Analytics & Insights in 2013. During her tenure, Becky and her team have made tremendous contributions across the organization – from product renovations and introductions to the revamped Domino’s Rewards program and myriad strategy-driving initiatives, including all of Domino’s national advertising campaigns. Becky is passionate about leveraging the power of consumer insights and market research to enable data-driven decisions."
      },
      {
        "name": "Sarah Goslin",
        "title": "Associate Manager Research Science",
        "company": "Domino's Pizza",
        "profileUrl": "https://informaconnect.com/tmre/speakers/sarah-goslin/",
        "bio": "Sarah Goslin, Associate Manager Research Science, joined Domino’s Global Analytics & Insights in 2023. In her role, Sarah leads all research related to Domino’s national advertising campaigns, including TV, radio and digital channels across the general and Spanish-language markets. Sarah has developed a strong acumen for quantitative and qualitative research from her experience working as a supplier-side Research Manager (Gongos, Burke, Talk Shoppe) across a variety of sectors and specialties including Automotive, Healthcare, CPG, and QSR. Sarah has a keen eye for detail and is a master at optimizing creative assets based on consumer feedback and insight."
      }
    ]
  },
  {
    "session_type": "Presentation",
    "title": "Moving from Insights to Strategic Thought Leadership",
    "description": "At an inflection point in an industry that is often defined by shame and stigma, Resmed realized the key to driving business success was recentering around what is most important – the heart and mind of the customer. Laura McCoy will present how insight-inspired leadership can create a more empathetic culture, more purposeful communications and a reinvigorated product experience.",
    "track": "TRACK 5: LEADERSHIP, STRATEGY & ROI",
    "time": "Tuesday, 8 October 2024 2:05pm - 2:35pm",
    "speakers": [
      {
        "name": "Laura McCoy",
        "title": "Senior Director, Global Market Research and Intelligence",
        "company": "ResMed",
        "profileUrl": "https://informaconnect.com/tmre/speakers/laura-mccoy/",
        "bio": "Laura McCoy serves as the Senior Director of Customer Insights at ResMed, which provides cloud-connectable medical devices for treating sleep apnea, chronic obstructive pulmonary disease, and other respiratory conditions. Laura manages the Global Market Research & Intelligence team and is a strategic thought leader who helps drive informed decisions and strategies that enable the business to navigate change and maintain a competitive advantage in a dynamic market. By delivering actionable strategic recommendations and infusing the voice of customers throughout the organization, she inspires and influences global product innovation roadmaps and commercial go-to-market strategies. Her passion is to lead with integrity and authenticity, foster connections, exchange ideas, bring insights to life, and thrive in uniting people to shape decisions."
      }
    ]
  },
  {
    "session_type": "Presentation",
    "title": "Panel: Mastering Market Research: Crafting a Roadmap for Analyst Skill Evolution",
    "description": "Join the leadership team of Universal Theme Parks' Insights Organization as we unveil our meticulously crafted rubric for guiding team members through skill progression within the department. Drawing upon decades of experience developing in house teams, we'll showcase our roadmap for analysts, encompassing domains such as technical analytics, storytelling, leadership, and critical thinking. We'll explore how making these skill expectations overt fosters employee agency in managing their own career trajectories, emphasizing the crucial role of a culture grounded in kind yet candid feedback.\n\nKey Takeaways:\n\nUnderstand the components of a comprehensive rubric for analyst skill progression.\nDiscover how transparency in skill expectations empowers team members to take ownership of their career development, fostering a culture of continuous growth and improvement.\nLearn strategies for cultivating a workplace atmosphere characterized by both kindness and candidness, essential for effective feedback mechanisms that drive individual and organizational success.",
    "track": "TRACK 5: LEADERSHIP, STRATEGY & ROI",
    "time": "Tuesday, 8 October 2024 2:40pm - 3:10pm",
    "speakers": [
      {
        "name": "Kate Brelsford",
        "title": "Sr. Director, Ethnographic Services",
        "company": "Universal Destinations & Experiences",
        "profileUrl": "https://informaconnect.com/tmre/speakers/kate-brelsford/",
        "bio": "Kate Brelsford is a medical anthropologist and public health professional who made the logical leap from academic bioethics research to research on theme parks in 2020. Since then, she has transferred her methodological expertise to better understand consumer-related topics, corporate culture, and organizational processes at Universal Destinations & Experiences, developing a nascent ethnographic program designed to provide holistic insights on complex issues to improve guests' experiences."
      },
      {
        "name": "Jennifer Avery",
        "title": "Senior Vice President, Strategic Insights",
        "company": "Universal Destinations & Experiences",
        "profileUrl": "https://informaconnect.com/tmre/speakers/jennifer-avery/",
        "bio": "Jennifer Avery is a cultural anthropologist and insights leader who has been tackling impossible projects and complex sociological questions in market research for more than twenty years. In her current role as Senior Vice President, Strategic Insights at Universal Destinations and Experiences, Jennifer leads global strategic and insights work that informs the next evolution of immersive theme parks entertainment."
      },
      {
        "name": "Jessica Golson",
        "title": "Director, Consumer Insights",
        "company": "Universal Destinations & Experiences",
        "profileUrl": "https://informaconnect.com/tmre/speakers/jessica-golson/",
        "bio": "Jessica has devoted nearly 15 years to learning and growing in the Consumer Insights field. With expertise in survey design and honed abilities to identify patterns and transform output into insights, she helps the UDX organization solve business problems and support strategic initiatives."
      },
      {
        "name": "Emily Gottfried",
        "title": "Senior Manager, Consumer Insights",
        "company": "Universal Destinations & Experiences",
        "profileUrl": "https://informaconnect.com/tmre/speakers/emily-gottfried/",
        "bio": "Emily has 10 years of experience in consumer insights, market research, and business strategy. She combines a passion for understanding consumer perceptions and behavior with the ability to synthesize quantitative and qualitative data at Universal Destinations and Experiences, where she currently leads end-to-end primary research in support of marketing, operations, global long-range planning, and other strategic initiatives."
      },
      {
        "name": "Stephanie Heller",
        "title": "Senior Manager, Consumer Insights",
        "company": "Universal Destinations & Experiences",
        "profileUrl": "https://informaconnect.com/tmre/speakers/stephanie-heller/",
        "bio": "Stephanie Heller is a Consumer Insights Senior Manager at Universal Destinations & Experiences."
      }
    ]
  },
  {
    "session_type": "Presentation",
    "title": "From Meh to Marvelous: Supercharging Your Research Team Meetings",
    "description": "As research leaders, meetings with our researchers are table stakes. Yet, how often do we reflect on the efficacy of those meetings, or consider how we might supercharge time with our team to achieve key outcomes? How can we avoid having our teams think, \"That could've been an email\"? At Vanguard, we work alongside research leaders who oversee upwards of 100 researchers. Some teams are small (~5), while others are large (~40). Across the leadership team, we've adopted different meetings for different purposes. In this session, we'll share how we spend time with our team, including:\n\nFrameworks for conceptualizing meeting goals and cadences\nSample agendas\nExamples of exercises we run to get stuff done\nVerbatims from researchers on how it's going and where we still have opportunities to tweak\n\nTo that end, while we've tried a lot of different things, we by no means have it all figured out. This session is about mutual idea exchange. What have you put in place to drive team engagement, facilitate idea sharing, and generally move things forward with your team?\n\n",
    "track": "TRACK 5: LEADERSHIP, STRATEGY & ROI",
    "time": "Tuesday, 8 October 2024 4:05pm - 4:35pm",
    "speakers": [
      {
        "name": "Alicia Weir",
        "title": "Head of Financial Advisor Experience Research",
        "company": "Vanguard",
        "profileUrl": "https://informaconnect.com/tmre/speakers/alicia-weir/",
        "bio": "Alicia is a UX researcher turned people leader. She runs an awesome B2B research team that busts myths around \"traditional research\" and inspires client obsession."
      },
      {
        "name": "Julie Mon",
        "title": "UX Research Team Leader",
        "company": "Vanguard",
        "profileUrl": "https://informaconnect.com/tmre/speakers/julie-mon/",
        "bio": "Julie is a research leader with a background in UX & HCI. She leads Vanguard's Institutional UX Research Team supporting journey and product teams from discovery to delivery."
      }
    ]
  },
  {
    "session_type": "Presentation",
    "title": "Welcome with Burke",
    "description": "NOT_FOUND",
    "track": "TRACK 5: LEADERSHIP, STRATEGY & ROI",
    "time": "Wednesday, 9 October 2024 11:00am - 11:10am",
    "speakers": [
      {
        "name": "Tara Wiley",
        "title": "Vice President, Qualitative",
        "company": "Burke",
        "profileUrl": "https://informaconnect.com/tmre/speakers/tara-wiley/",
        "bio": "Tara serves as Vice President at Burke, where she oversees the company’s Qualitative business efforts. With nearly 20 years of research experience, she excels at helping clients tackle complex business challenges. Tara is passionate about connecting with people in innovative ways to uncover their inspirations. Her curiosity and expertise drive her leadership, shaping the overall strategy for Burke’s Qualitative business and team."
      }
    ]
  },
  {
    "session_type": "Presentation",
    "title": "Building a Customer Journey Driven by Insights and Powered by Strategy",
    "description": "This interactive session will allow attendees to:\n\nWork collaboratively across marketing, product, and sales to create exceptional experiences\nUse insights to determine critical pain points and opportunities across the customer journey\nSet strategic priorities that are customer centric and outcome focused",
    "track": "TRACK 5: LEADERSHIP, STRATEGY & ROI",
    "time": "Wednesday, 9 October 2024 11:10am - 11:40am",
    "speakers": [
      {
        "name": "Antoinette Staples",
        "title": "Senior Director, Customer Insights & Success",
        "company": "McKesson",
        "profileUrl": "https://informaconnect.com/tmre/speakers/antoinette-staples/",
        "bio": "Antoinette Staples Branch is an innovative thought leader specializing in Customer Insights & Success. In her newest role at McKesson she has the pleasure of leading a dynamic team with a focus on analytics, customer journey, voice of customer, and marketing. She has more than a decade of experience focused on looking comprehensively across the end to end journey to derive the most critical insights. She prides herself on helping her team to drive actions that positively influence the customer experience, and she thrives in working strategically with cross functional teams. Her passion is creating a customer centric-culture that promotes data driven decisions that produce long-term success. In her work she has supported initiatives in the B2B and B2C space and enjoys every opportunity she has to create brand loyalty, support business growth, and increase customer satisfaction."
      }
    ]
  },
  {
    "session_type": "Presentation",
    "title": "Are KPIs & Benchmarks Really Doing a Good Job of Predicting Product Concept Strength? Learn How CPG Companies like Coca-Cola, Nestle and Carlsberg are Shifting to AI Predictions to Increase Their New Product Launch Success",
    "description": "The vast majority of product launches within CPG continue to fail. This is something that has been and is still tolerated by many large CPG companies, who explain away this waste of money and natural and human resources by stating that innovation is hard and risky, that a high failure rate is the nature of innovation. But does it really need to be that way?\n\nWhile many CPG companies continue to rely on traditional KPIs and benchmarks in their concept development and validation work, now with the help of AI more accurate and actionable approaches are available. By utilizing AI you can now combine quant, qual and in-market data to deliver more accurate and actionable insights.\n\nKey takeaways / what you will learn:\n\nWhy predictions, decisions and learnings utilizing AI are more accurate and reliable than relying on traditional KPIs and benchmarks\nHow open ended data is used to weigh in the respondents conditions to try a new product meaning counting in the if and buts and the excitement of the respondents to get more accurate validation metrics\nHow international CPG companies are benefitting from AI-based predictions and advice and what results they see\n\n",
    "track": "TRACK 5: LEADERSHIP, STRATEGY & ROI",
    "time": "Wednesday, 9 October 2024 11:45am - 12:15pm",
    "speakers": [
      {
        "name": "Ben Harknett",
        "title": "CEO",
        "company": "Cambri",
        "profileUrl": "https://informaconnect.com/tmre/speakers/ben-harknett/",
        "bio": "Ben has a long experience of helping global enterprises implement and get value out of data-driven processes. His expertise lies in strategic data centralization and how that helps companies make better decisions and capture value that will build the company’s knowledge and learning over time."
      }
    ]
  },
  {
    "session_type": "Presentation",
    "title": "Critical Aspects of Career Development in a Changing Market Research Industry",
    "description": "The market research landscape is changing at a rapid pace, with the promise of groundbreaking innovation around every corner. However, only when practitioners master the fundamentals can they realize the full potential and value of market research and drive innovation within it. Further, an investment in training leads to enhanced benefits both to employees and to company performance. During this session, we will present the latest data from a global study of market research professionals, their career satisfaction, and the industry's future trajectory, along with a new wave of data collected in 2024.\n\nExamine the latest data from an industry-wide study, conducted among a global sample of market research and insights practitioners, designed to help the industry gain a deeper understanding of the state of our profession and the vital role that training plays.\nLearn more about how market research professionals view their profession, how satisfied they are with their careers, and how they see the future of market research.\nUnderstand what market research professionals prioritize when it comes to education, upscaling, and training opportunities - and why it should matter to managers and employers.",
    "track": "TRACK 5: LEADERSHIP, STRATEGY & ROI",
    "time": "Wednesday, 9 October 2024 12:20pm - 12:50pm",
    "speakers": [
      {
        "name": "Anthony Jackel",
        "title": "Director of Consumer Analytics",
        "company": "Ferrara Candy & MRII Board of Director",
        "profileUrl": "https://informaconnect.com/tmre/speakers/anthony-jackel/",
        "bio": "Anthony is the director of consumer analytics at Ferrara Candy Company, where he is responsible for leading the brand and category performance reporting, owning the marketing effectiveness agenda, and driving the analytics transformation for the company. Prior to Ferrara, Anthony worked in brand strategy consulting and learned about his passion for consumer behavior and data on the insights and strategy team at Kraft Heinz. He currently serves on the board of directors for the Market Research Institute International (MRII), which is a non-profit corporation with the mission to offer professional development and continuing education programs for the practice of market research."
      },
      {
        "name": "Ed Keller",
        "title": "Executive Director",
        "company": "Market Research Institute International (MRII)",
        "profileUrl": "https://informaconnect.com/tmre/speakers/ed-keller/",
        "bio": "Ed Keller is the Executive Director of the Market Research Institute International (MRII), a not-for-profit educational institute providing online education and training for market research professionals worldwide. He is also the CEO of the Keller Advisory Group. Keller has had a distinguished career in the research and insights industry, leading both large insights agencies as well as his own firm. Keller is an ESOMAR/Insight250 Insights Legend Awardee and a member of the Market Research Hall of Fame, among other honors he has received.\n\nX. @mrii_learn\ninsta. @mrii_ learn\n\n"
      }
    ]
  },
  {
    "session_type": "Presentation",
    "title": "Ask Me Anything: Increasing Visibility of the Insights Function Organization-Wide While Elevating your Personal Brand",
    "description": "Researchers have long discussed earning a 'seat at the table'. This session explores new ideas with specific recommendations on how you can dramatically increase the visibility of the insights function, individual team members, and most importantly, your work. Senior business leaders will be demanding your presence 'at the table.' The session will also identify opportunities to elevate your personal brand both within and outside your organization.",
    "track": "TRACK 5: LEADERSHIP, STRATEGY & ROI",
    "time": "Wednesday, 9 October 2024 2:05pm - 2:35pm",
    "speakers": [
      {
        "name": "Kerry Sette",
        "title": "Vice President, Head of Consumer Insights & Research",
        "company": "Voya Financial",
        "profileUrl": "https://informaconnect.com/tmre/speakers/kerry-sette/",
        "bio": "Kerry specializes in strategic brand research (with extensive experience in brand evaluation and strategy), cultural and consumer insight with over 17 years of experience across both qual and quant."
      }
    ]
  },
  {
    "session_type": "Presentation",
    "title": "Enhancing Employee Engagement with General Mills: Applying & Leveraging Research Methodologies Internally",
    "description": "Brand leaders can’t create exceptional brands without a culture of engaged employees and strong leadership. While teams are accustomed to investing in deep research to understand their consumers, they can often forget to look inward and to understand what their employees need first. Join General Mills’ Dany Eldik as she discusses how she and her team utilized market research techniques and methodologies often reserved for external audiences in order to examine inward and to understand the General Mills employee experience, and how General Mills leveraged these findings to co-create solutions in collaboration with employees. Attendees will take away:\n\nLearn how delivering an exceptional customer experience starts with enabling a strong employee experience and culture.\nLearn how positive psychology and behavioral science techniques can be utilized in order to understand and leverage the inherent strengths within a brand and an organization.\nLearn tips to utilize and combine multiple methodologies and approaches in order to holistically understand an audience, inside or outside of the workplace.",
    "track": "TRACK 5: LEADERSHIP, STRATEGY & ROI",
    "time": "Wednesday, 9 October 2024 2:40pm - 3:10pm",
    "speakers": [
      {
        "name": "Dany Eldik",
        "title": "Plant Manager",
        "company": "General Mills",
        "profileUrl": "https://informaconnect.com/tmre/speakers/dany-eldik/",
        "bio": "General Mills, creator of iconic brands such as Cheerios and Pillsbury, is committed to creating food with a purpose and to its core four values to employees: Win Together, Continuously Innovate, Champion Belonging, and Do the Right Thing, All the Time. Dany Eldik leads the Belvidere, IL site, as the Plant Manager, which is a 120-year-old site that is home to 700 amazing team members. The site proudly produces some of General Mills most iconic brands Nature Valley, FiberOne, Fruit by the Foot, Larabar and various Cereal Brands. Dany has been with General Mills for 18 years and has worked across four manufacturing sites where he has had the honor of serving over 2,000 team members. He helps to drive an understanding of employee needs and leads initiatives to improve the employee experience by utilizing employee engagement metrics and market research methodologies – often found in consumer research – in order to more deeply understand employee needs. Dany is driven by creating a culture of inclusivity and belonging and fostering strong people leaders and an employer brand within General Mills."
      }
    ]
  },
  {
    "session_type": "Case Study",
    "title": "Fireside Chat: Delivering Your Insights Impact",
    "description": "This session will explore best practices for how to level up your impact as an insights leader within your organization. We will look to have an interactive conversation to freely share ideas and tips as to how to best engage your stakeholders and drive value from the research that you deliver.",
    "track": "TRACK 5: LEADERSHIP, STRATEGY & ROI",
    "time": "Wednesday, 9 October 2024 3:45pm - 4:15pm",
    "speakers": [
      {
        "name": "Colleen Funkey",
        "title": "Vice President, Consumer Insights",
        "company": "The Estée Lauder Companies Inc.",
        "profileUrl": "https://informaconnect.com/tmre/speakers/colleen-funkey/",
        "bio": "At the Estée Lauder Companies, Colleen seeks to understand the ‘why’ behind the ‘what’ in order to design brand strategies and business solutions that connect in a relevant, credible + ownable way."
      },
      {
        "name": "Tamar Rimmon",
        "title": "Vice President, Research and Analytics",
        "company": "Fandom",
        "profileUrl": "https://informaconnect.com/tmre/speakers/tamar-rimmon/",
        "bio": "Tamar Rimmon is Vice President, Research and Analytics at Fandom - the world’s largest fan platform, where fans learn about and celebrate their favorite fandoms in pop culture, gaming, TV and film. At Fandom, Tamar oversees all analytics, business intelligence and consumer insights functions, and partners with stakeholders across the company to ensure strategies are informed by data and insights and aligned with consumer needs and behaviors. Prior to Fandom, Tamar was the General Manager, Editorial, Growth and Marketing at Odyssey, and Senior Director, Audience Development and Analytics Strategy at Condé Nast. In a career that spans the digital media, television and publishing industries, Tamar had always been focused on serving as the voice of the consumer and building a data-driven culture. She holds an MBA from Columbia Business School and a BA in Cognitive Science and Journalism."
      },
      {
        "name": "Elias Soussou",
        "title": "Senior Director, Global Consumer & Market Insights",
        "company": "FGX International, a division of EssilorLuxottica",
        "profileUrl": "https://informaconnect.com/tmre/speakers/elias-soussou/",
        "bio": "Elias Soussou is a seasoned leader in the field of consumer and market insights, currently serving as the Senior Director of Global Consumer & Market Insights at FGX, a division of EssilorLuxottica. With over 20 years of experience in the consumer products industry, Elias brings a wealth of expertise in understanding consumer behavior, market dynamics, and emerging trends.\n\nIn his role at FGX, Elias is responsible for driving strategic initiatives that leverage insights to inform decision-making and fuel business growth on an international scale. He is responsible for overseeing the development and execution of comprehensive research programs.\n\nElias’ career has provided a wealth of experiences that have helped shape his perspectives and views, with an overall belief in the power of insights to drive consumer and business impact. He began his career working in advertising account management, developing ad strategies and campaigns for J&J and P&G, followed by strategy consulting roles for large CPG clients such as Diageo, MillerCoors, Nestle and Campbell Soup. Elias’ expertise covers a range of both qualitative and quantitative methodologies, spanning multiple continents and markets. In his spare time, Elias loves to travel, spend time with his family, and have fun with his 6-year old prompting ChatGPT on endless story ideas."
      },
      {
        "name": "Giles Smith",
        "title": "Director of Key Accounts",
        "company": "Dragonfly AI",
        "profileUrl": "https://informaconnect.com/tmre/speakers/giles-smith/",
        "bio": "BIO_NOT_FOUND"
      }
    ]
  }
]